{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jennifer Griffin", "title": "Last surviving Doolittle Raider from attack on Japan remembered", "description": "Lt. Col. Richard Cole, the last surviving Doolittle Raider, is to be remembered at a memorial in Texas.", "url": "https://www.foxnews.com/world/last-surviving-doolittle-raider-from-attack-on-japan-remembered", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/04/17/694940094001_6027271105001_6027267660001-vs.jpg", "publishedAt": "2019-04-18T00:00:08Z", "content": "It was a turning point in the war, just four months after Pearl Harbor, and gave the nation hope.\r\nLt. Col. Richard Cole, the last surviving Doolittle Raider, died last week at the age of 103. He was Jimmy Doolittle's co-pilot in the lead bomber that launched… [+2484 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Japan apologizes to those forcibly sterilized, vows redress", "description": "Japan's government has apologized to tens of thousands of victims forcibly sterilized under a now-defunct Eugenics Protection Law and promised to pay compensation.", "url": "https://www.foxnews.com/world/japan-apologizes-to-those-forcibly-sterilized-vows-redress", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-04-24T03:46:06Z", "content": "TOKYO Japan's government has apologized to tens of thousands of victims forcibly sterilized under a now-defunct Eugenics Protection Law and promised to pay compensation.\r\nChief Cabinet Secretary Yoshihide Suga says he is offering \"sincere remorse and heartfel… [+469 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Japan police: Man put knives on desk of emperor's grandson", "description": "Japanese police on Monday arrested a man linked to knives found on the school desk of Emperor Akihito's 12-year-old grandson.", "url": "https://www.foxnews.com/world/japan-police-man-put-knives-on-desk-of-emperors-grandson", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-04-29T14:55:40Z", "content": "TOKYO Japanese police on Monday arrested a man linked to knives found on the school desk of Emperor Akihito's 12-year-old grandson.\r\nThe incident occurred last Friday as Japan was preparing for Akihito's abdication on Tuesday. Prince Hisahito will become seco… [+547 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Lucia Suarez Sang", "title": "Japanese science university professor taught students how to make ecstasy: report", "description": "A 61-year-old science college professor in Japan channeled his inner \"Breaking Bad's\" Walter White when he allegedly taught his students how to manufacture ecstasy to \"further their knowledge\" of pharmaceuticals.", "url": "https://www.foxnews.com/world/japanese-science-professor-ecstasy-mdma", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/methylenedioxy-methamphetamine.jpg", "publishedAt": "2019-04-17T15:33:53Z", "content": "A 61-year-old science college professor in Japan channeled his inner Walter White when he allegedly taught his students how to manufacture ecstasy to “further their knowledge” of pharmaceuticals.\r\nTatsunori Iwamura, a professor at Matsuyama University in Ehim… [+1777 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Q&A: What's in a name for Japan emperor's new era?", "description": "Japan's government has unveiled an era name, \"Reiwa,\" or \"pursuing harmony,\" for soon-to-be Emperor Naruhito, who will succeed the Chrysanthemum throne on May 1.", "url": "https://www.foxnews.com/world/qa-whats-in-a-name-for-japan-emperors-new-era", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-6a2dc8a6ded94892944a24b4f6f345fa-1.png", "publishedAt": "2019-04-01T08:48:15Z", "content": "TOKYO Japan's government has unveiled an era name, \"Reiwa,\" or \"pursuing harmony,\" for soon-to-be Emperor Naruhito, who will succeed the Chrysanthemum throne on May 1. His father, Emperor Akihito, is abdicating, with his \"Heisei\" era coming to an end the day … [+3833 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Japan to name new era for soon-to-be emperor Naruhito", "description": "Japan's government is holding top-secret meetings to decide a new era name for soon-to-be-emperor Naruhito, the crown prince who will succeed the Chrysanthemum throne from his father May 1. Emperor Akihito is abdicating on April 30, with his era of \"Heisei\" c…", "url": "https://www.foxnews.com/world/japan-to-name-new-era-for-soon-to-be-emperor-naruhito", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/ContentBroker_contentid-fe6835c6842d4fc0a14ff123524a1304-1.png", "publishedAt": "2019-04-01T00:45:58Z", "content": "TOKYO Japan's government is holding top-secret meetings to decide a new era name for soon-to-be-emperor Naruhito, the crown prince who will succeed the Chrysanthemum throne from his father May 1.\r\nEmperor Akihito is abdicating on April 30, with his era of \"He… [+2857 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Barnini Chakraborty", "title": "Russia agrees to free nearly 100 orcas, belugas kept in 'whale prison'", "description": "Bowing to global criticism, Russia on Monday agreed to free nearly 100 whales held captive in the country's Far East. Images of the whales - 10 orcas and 87 belugas - kept in cramped spaces in a bay near the Sea of Japan port city of Nakhodka surfaced last ye…", "url": "https://www.foxnews.com/world/russia-agrees-to-free-nearly-100-orcas-belugas-kept-in-whale-prison", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/Whale-Prison-1-RT.jpg", "publishedAt": "2019-04-08T20:36:06Z", "content": "Bowing to global criticism, Russia on Monday agreed to free nearly 100 whales held captive in the country's Far East.\r\nImages of the whales - 10 orcas and 87 belugas - kept in cramped spaces in a bay near the Sea of Japan port city of Nakhodka surfaced last y… [+3362 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Japan's PM asks for support in abduction dispute with NKorea", "description": "Japanese Prime Minister Shinzo Abe says he has asked the leaders of four Central European countries for help in a long dispute with North Korea over the abductions of Japanese citizens decades ago.", "url": "https://www.foxnews.com/world/japans-pm-asks-for-support-in-abduction-dispute-with-nkorea", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-27d9c1e853f544b784b8ccef1552eccc-1.png", "publishedAt": "2019-04-25T11:27:16Z", "content": "BRATISLAVA, Slovakia Japanese Prime Minister Shinzo Abe says he has asked the leaders of four Central European countries for help in a long dispute with North Korea over the abductions of Japanese citizens decades ago.\r\nAbe says he has asked for \"understandin… [+553 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Japanese court extends new detention for Nissan ex-chair Ghosn, drawing scrutiny of country's legal system", "description": "A Japanese court on Friday approved the detention of former Nissan Chairman Carlos Ghosn through April 14 after his latest arrest over financial misconduct allegations, a move that has raised questions among legal experts.", "url": "https://www.foxnews.com/world/court-extends-new-detention-for-nissan-ex-chair-ghosn", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/4d4aa7e1-1024-preview-1.jpg", "publishedAt": "2019-04-05T10:33:29Z", "content": "A Japanese court on Friday approved the detention of former Nissan Chairman Carlos Ghosn through April 14 after his latest arrest over financial misconduct allegations, a move that has raised questions among legal experts.\r\nThe former star executive was taken… [+3598 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Greg Norman", "title": "Japanese F-35 stealth jet parts found as US destroyer joins in frantic search", "description": "Parts belonging to the Japanese F-35 stealth fighter jet that crashed into the Pacific Ocean during a training flight have been recovered, the country’s defense ministry announced Wednesday, as a U.S. guided-missile destroyer joined in on the search for the r…", "url": "https://www.foxnews.com/world/parts-of-missing-japanese-f-35-stealth-jet-found-as-us-destroyer-joins-in-on-search", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/f-35-plane.jpg", "publishedAt": "2019-04-10T12:52:44Z", "content": "Some of the parts belonging to a missing Japanese F-35 stealth fighter jet that crashed into the Pacific Ocean during a training flight have been recovered, the country’s defense ministry announced Wednesday, as a U.S. guided-missile destroyer joined in on th… [+1933 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "The Latest: Japanese people mark end of Heisei era", "description": "The Latest on Emperor Akihito's abdication (all times local): 3:45 p.m.", "url": "https://www.foxnews.com/world/the-latest-japanese-people-mark-end-of-heisei-era", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-147f6221890047d9b1845f05a4ef944b.png", "publishedAt": "2019-04-30T07:04:29Z", "content": "TOKYO The Latest on Emperor Akihito's abdication (all times local):\r\n3:45 p.m.\r\nJapanese people are visiting shrines and temples and eating dinners marking the end of the Heisei era as Emperor Akihito abdicates.\r\nAkihito visited a shrine to report his retirem… [+2325 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Aaro", "title": "US Navy sailor kills himself after stabbing Japanese woman: report", "description": "A U.S. Navy sailor allegedly stabbed a Japanese woman before taking his own life in an Okinawa apartment on Saturday.", "url": "https://www.foxnews.com/world/us-navy-sailor-kills-himself-after-stabbing-japanese-woman-report", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/19103348240439.jpg", "publishedAt": "2019-04-14T17:15:00Z", "content": "A U.S. Navy sailor allegedly stabbed a Japanese woman before taking his own life in an Okinawa apartment.\r\nThe two were found dead Saturday morning inside a six-story apartment building in the Kuwae district of Chatan, according to an Okinawa Prefectural Poli… [+1911 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Robert Gearty", "title": "Japan's emperor declares abdication in historic ceremony in Tokyo", "description": "In a formal morning coat, Japan's popular 85-year-old emperor abdicated his throne Tuesday during a brief and solemn palace ceremony that was televised live to the nation.", "url": "https://www.foxnews.com/world/japans-emperor-declares-abdication-in-historic-ceremony-in-tokyo", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/Emperor-and-son-1-AP.jpg", "publishedAt": "2019-04-30T13:40:56Z", "content": "In a formal morning coat, Japan’s popular 85-year-old emperor abdicated his throne Tuesday during a brief and solemn palace ceremony that was televised live to the nation.\r\nEmperor Akihito’s abdication—the first in more than 200 years—marks the end of a three… [+3313 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Aaro", "title": "Blind sailor successfully completes non-stop Pacific voyage", "description": "A Japanese sailor has completed a non stop trek across the pacific, becoming the first person visual impared person to do so.", "url": "https://www.foxnews.com/world/blind-sailor-successfully-completes-non-stop-pacific-voyage", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/Mitsuhiro-Iwamoto.jpg", "publishedAt": "2019-04-20T17:10:42Z", "content": "A Japanese sailor has completed a two month, non-stop trek across the Pacific Ocean, becoming the first totally blind person to do so.\r\nMitsuhiro Iwamoto, 52, left San Diego on Feb. 24, sailing 8,700 miles on his 40 ft. boat, named \"Dream Weaver\", to Japan wi… [+2991 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Renault board to discuss Ghosn investigation, ex-CEO's pay", "description": "French carmaker Renault SA's board is holding a special meeting to discuss the latest results of its internal investigation into ex-boss Carlos Ghosn, amid new reports about suspicious payments under his watch.", "url": "https://www.foxnews.com/world/renault-board-to-discuss-ghosn-investigation-ex-ceos-pay", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-04-02T08:04:41Z", "content": "PARIS French carmaker Renault SA's board is holding a special meeting to discuss the latest results of its internal investigation into ex-boss Carlos Ghosn, amid new reports about suspicious payments under his watch.\r\nA Renault official told The Associated Pr… [+575 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Japan's PM vows to help France in rebuilding Notre Dame", "description": "Japanese Prime Minister Shinzo Abe is pledging to help France rebuild the fire-ravaged Notre Dame Cathedral.", "url": "https://www.foxnews.com/world/japans-pm-vows-to-help-france-in-rebuilding-notre-dame", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-26754aed1e134b868d529eee20890b49.png", "publishedAt": "2019-04-23T10:39:54Z", "content": "PARIS Japanese Prime Minister Shinzo Abe is pledging to help France rebuild the fire-ravaged Notre Dame Cathedral.\r\nAbe stopped in France Tuesday as part of his tour of Europe and North America.\r\nSpeaking alongside French president Emmanuel Macron, Abe said t… [+556 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Ace Swedish coder held by Ecuador was defender of Assange", "description": "An ace Swedish programmer has been arrested in Ecuador in an alleged plot to blackmail the country's president over his abandonment of Julian Assange.", "url": "https://www.foxnews.com/world/ace-swedish-coder-held-by-ecuador-was-defender-of-assange", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-04-12T22:44:28Z", "content": "CARACAS, Venezuela An ace Swedish programmer has been arrested in Ecuador in an alleged plot to blackmail the country's president over his abandonment of Julian Assange.\r\nOla Bini was an early, ardent supporter of Wikileaks. Friends say the 36-year-old encryp… [+590 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Emperor performs ritual to report abdication to Shinto gods", "description": "Emperor Akihito is praying at a Japanese shrine in a ritual to report his upcoming abdication to the Shinto gods.", "url": "https://www.foxnews.com/world/emperor-performs-ritual-to-report-abdication-to-shinto-gods", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-31e2c9ec7a974d388befd96e1d1d78ea.png", "publishedAt": "2019-04-18T04:17:46Z", "content": "TOKYO Emperor Akihito is praying at a Japanese shrine in a ritual to report his upcoming abdication to the Shinto gods.\r\nThe 85-year-old emperor will retire on April 30 in the first abdication in 200 years and a rarity in Japan's ancient imperial history.\r\nCr… [+532 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "At least 39 foreign tourists among Sri Lanka fatalities", "description": "At least 290 people were killed in a series of nine bombings on churches and hotels in Sri Lanka on Easter Sunday.", "url": "https://www.foxnews.com/world/at-least-39-foreign-tourists-among-sri-lanka-fatalities", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/ContentBroker_contentid-aef495a5caa147a8b4234cb9b22b4813-1.png", "publishedAt": "2019-04-22T11:52:35Z", "content": "COLOMBO, Sri Lanka At least 290 people were killed in a series of nine bombings on churches and hotels in Sri Lanka on Easter Sunday. Sri Lankan authorities say 39 foreign tourists died in the attacks, with 28 others injured. A look at some of the countries w… [+621 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Japanese police probe knife on desk of emperor's grandson", "description": "Japanese media reports say police are investigating a knife that was placed on the school desk of Emperor Akihito's grandson.", "url": "https://www.foxnews.com/world/japanese-police-probe-knife-on-desk-of-emperors-grandson", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-04-27T04:04:57Z", "content": "TOKYO Japanese media reports say police are investigating a knife that was placed on the school desk of Emperor Akihito's grandson.\r\nThe incident involving 12-year-old Hisahito, who is in succession line for the Chrysanthemum Throne, comes as Japan prepares f… [+551 chars]"}]}